Catalogs/Кандидаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Кандидаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резюме</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезюмеТекст</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтклоненияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднийРейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРезюме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОСебе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СопроводительноеПисьмо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьДохода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьОжидаемогоДоходаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтапРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеРезюме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСозданияКандидата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияКандидата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОценки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыСозданияКандидата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыСозданияКандидата</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РучнойВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФайлРезюме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РекрутинговыйСайт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Кандидаты/Forms/МастерСозданияКандидата/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Вакансия = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Вакансия");
	ЗаполнитьПодразделение(Вакансия, Подразделение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВакансияПриИзменении(Элемент)
	
	ЗаполнитьПодразделение(Вакансия, Подразделение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	Элементы.ДекорацияСтраницы.Заголовок = НСтр("ru = '2 из 2'");
	Элементы.Далее.Видимость = Ложь;
	Элементы.Назад.Видимость = Истина;
	Элементы.Готово.Видимость = Истина;
	Элементы.СтраницыНовыйКандидат.ТекущаяСтраница = Элементы.СтраницаПозиционирование;  
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Элементы.ДекорацияСтраницы.Заголовок = НСтр("ru = '1 из 2'");
	Элементы.Далее.Видимость = Истина;
	Элементы.Назад.Видимость = Ложь;
	Элементы.Готово.Видимость = Ложь;
	Элементы.СтраницыНовыйКандидат.ТекущаяСтраница = Элементы.СтраницаФИОКонтакты;
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ОткрытьФормуНовогоКандидата(); 
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуНовогоКандидата();
	
	ОписаниеРезюмеКандидата = ПодборПерсоналаКлиентСервер.ОписаниеРезюмеКандидата();
	
	ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО);
	ОписаниеРезюмеКандидата.Фамилия = ЧастиИмени.Фамилия;
	ОписаниеРезюмеКандидата.Имя = ЧастиИмени.Имя;
	ОписаниеРезюмеКандидата.Отчество = ЧастиИмени.Отчество;
	
	ОписаниеРезюмеКандидата.Вакансия = Вакансия;
	ОписаниеРезюмеКандидата.Подразделение = Подразделение;
	ОписаниеРезюмеКандидата.ГруппаДоступаКандидата = ГруппаДоступа;
	ОписаниеРезюмеКандидата.СпособСозданияКандидата = ПредопределенноеЗначение("Перечисление.СпособыСозданияКандидата.РучнойВвод");
	ОписаниеРезюмеКандидата.КонтактнаяИнформация = Новый Массив;
	
	Если ЗначениеЗаполнено(Телефон) Тогда
		Описание = ОписаниеКонтактнойИнформации();
		Описание.Тип = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ТипыКонтактнойИнформации.Телефон");
		Описание.Вид = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов");
		Описание.Представление = Телефон;
		ОписаниеРезюмеКандидата.КонтактнаяИнформация.Добавить(Описание);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Почта) Тогда
		Описание = ОписаниеКонтактнойИнформации();
		Описание.Тип = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты");
		Описание.Вид = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов");
		Описание.Представление = Почта;
		ОписаниеРезюмеКандидата.КонтактнаяИнформация.Добавить(Описание);
	КонецЕсли;
	
	ПодборПерсоналаКлиент.ОткрытьФормуНовогоКандидата(
		Новый Структура("Вакансия", Вакансия),
		Новый Структура("ДанныеКандидата", ОписаниеРезюмеКандидата));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПодразделение(Вакансия, Подразделение)
	
	Если ЗначениеЗаполнено(Вакансия) Тогда
		Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вакансия, "Подразделение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеКонтактнойИнформации()
	Возврат Новый Структура("Тип, Вид, Представление");
КонецФункции

#КонецОбласти
